app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 19 Dec 2012 05:46:25 UTC +00:00], ["email", "sdf@gmail.com"], ["updated_at", Wed, 19 Dec 2012 05:46:25 UTC +00:00]]